{
  "weightsManifest": [
    {
      "paths": [
        "tiny_face_detector_model-shard1"
      ],
      "weights": [
        {
          "name": "weights",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/kernel",
          "shape": [1, 1, 64, 1],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
